import React, {useState} from "react";
import "./about-us.css";
import AboutUss from "./AboutUs.png";

const AboutUs = (props) => {
    const [federationId, setFederationId] = useState(props.federationId || null)
    return (
        <div className="wrapper-about-us">
            <div className="about-us-banner">
               <div className="banner-text"><div className="text">О нас </div></div>

            </div>

            <p>
                Разнообразный и богатый опыт новая модель<br/>
                организационной деятельности позволяет выполнять важные<br/>
                задания по разработке форм развития. С другой стороны<br/>
                постоянное информационно-пропагандистское обеспечение<br/>
                нашей деятельности влечет за собой процесс внедрения и<br/>
                модернизации модели развития. Значимость этих проблем<br/>
                настолько очевидна, что укрепление и развитие структуры<br/>
                играет важную роль в формировании новых предложений.<br/>
                Равным образом консультация с широким активом играет<br/>
                важную роль в формировании позиций, занимаемых<br/>
                участниками в отношении поставленных задач.<br/>
            </p>
            <p>
                Повседневная практика показывает, что дальнейшее развитие различных<br/>
                форм деятельности способствует подготовки и реализации<br/>
                соответствующий условий активизации. Таким образом<br/>
                начало повседневной работы по формированию позиции<br/>
                позволяет оценить значение модели развития. С другой<br/>
                стороны укрепление и развитие структуры влечет за собой<br/>
                процесс внедрения и модернизации новых предложений.<br/>
                Равным образом начало повседневной работы по<br/>
                формированию позиции влечет за собой процесс внедрения и<br/>
                модернизации модели развития.<br/>
            </p>

        </div>
    )
}
export default AboutUs;